package Data

// MineChestData 矿井宝箱相关数据，目前仅用于测试
// 来源：StardewValley.Locations.MineShaft.GetReplacementChestItem()
type MineChestData struct{}

// ChestFloors 有宝箱的层
var ChestFloors = []int{10, 20, 50, 60, 80, 90, 110}

// ItemsCN 每层宝箱的物品池（中文名）
var ItemsCN = map[int][]string{
	// 10层
	10: {
		"皮靴",
		"工作靴",
		"木剑",
		"铁制短剑",
		"疾风利剑",
		"股骨",
	},

	// 20层
	20: {
		"钢制轻剑",
		"木棒",
		"精灵之刃",
		"光辉戒指",
		"磁铁戒指",
	},

	// 50层
	50: {
		"冻土靴",
		"热能靴",
		"战靴",
		"镀银军刀",
		"海盗剑",
	},

	// 60层
	60: {
		"水晶匕首",
		"弯刀",
		"铁刃",
		"飞贼之胫",
		"木锤",
	},

	// 80层
	80: {
		"蹈火者靴",
		"黑暗之靴",
		"双刃大剑",
		"圣堂之刃",
		"长柄锤",
		"暗影匕首",
	},

	// 90层
	90: {
		"黑曜石之刃",
		"淬火阔剑",
		"蛇形邪剑",
		"骨剑",
		"骨化剑",
	},

	// 110层
	110: {
		"太空之靴",
		"水晶鞋",
		"钢刀",
		"巨锤",
	},
}
